Repository: john-safwat/Heimdall
Catalog: lib/Core/l10n/app_*.arb
Languages: ar

# yourLanguage
source: Choose Your Language ?
ar: اختر لغتك ؟

source: Finish
ar: انتهاء

source: Next
ar: التالي

source: Back
ar: رجوع

# makeItYourOwn
source: Crafted exclusively for you, customize your experience with personal flair.
ar: صُنعت خصيصًا لك، خصص تجربتك بأسلوب شخصي.

# welcome
source: Welcome To Heimdall
ar: مرحبا بك في Heimdall

# welcomeMessage
source: We Are Very Excited To Have You In Our Community
ar: نحن متحمسون للغاية لكونك جزء من مجتمعنا

# yourSecurity
source: Our Goal ... Your Security
ar: هدفنا...أمنك

# yourSecurityMessage
source: Your security is our top priority. We employ cutting-edge measures to safeguard your information and trust 24/7
ar: أمنك هو أولويتنا القصوى. نحن نستخدم أحدث التدابير لحماية معلوماتك وثقتك على مدار الساعة طوال أيام الأسبوع

# qrCode
source: Ready to dive in?
ar: هل انت مستعد لخوض التجربة ؟

# qrCodeMessage
source: 1 Step and You are Good To Go...Scan the QR code to effortlessly set up and activate. Your seamless experience awaits you!
ar: خطوة واحدة وستكون جاهزًا للانطلاق...امسح رمز الاستجابة السريعة ضوئيًا للإعداد والتنشيط بسهولة. تجربتك السلسة في انتظارك!

# loginTitle
source: Who's there?
ar: من هناك ؟

# loginMessage
source: Tell us a bit about yourself! Get started by registering or logging into your account on our mobile app.
ar: أخبرنا قليلا عن نفسك! ابدأ بالتسجيل أو تسجيل الدخول إلى حسابك على تطبيق الهاتف المحمول الخاص بنا.

# chatTitle
source: Keep In Touch
ar: ابق علي اتصال

# chatMessage
source: You Can Chat & Make Calls To any one any Time You are Just one step Away
ar: يمكنك الاتصال بالجميع في اي وقع بضغطة زر منك

source: Loading ...
ar: جار التحميل ...

source: Some Thing Went Wrong
ar: حدث خطاء ما

# emailCantBeEmpty
source: The Email Can't Be Empty
ar: يجب ادخال بريد الكتروني

# enterAValidEmail
source: Please Enter A Valid Email
ar: برجاء ادخال بريد الكتروني صحيح

# passwordCantBeEmpty
source: The Password Can't Be Empty
ar: يجب ادخال كلمة المرور

# invalidPasswordLength
source: The Password Must be More Than 8 Characters
ar: كلمة المرور يجب ان تكون اكبر من 8 حروف

source: Email
ar: البريد الالكتروني

source: Password
ar: كلمة المرور

source: Forget Password ?
ar: نسيت كلمة المرور ؟

source: Login
ar: تسجل الدخول

source: Don't Have Account ?
ar: ليس لديك حساب ؟

source: Create Account
ar: انشئ حساب

source: Or
ar: او

source: Login With Google
ar: تسجيل الدخول بحساب جوجل

source: Registration
ar: انشاء حساب

source: Name Can't be Empty
ar: يجب ادخال اسم

source: Invalid Name
ar: يجب ادخال اسم مناسب

# passwordDoseNotMatch
source: Password Doesn't Match
ar: كلمة المرور غير متطابقة

source: Name
ar: الاسم

source: Password Confirmation
ar: تاكيد كلمة المرور

source: Already Have Account ?
ar: بالفعل لديك حساب ؟

source: Account Created Successfully
ar: تم انشاء حساب بنجاح

source: We Sent Verification Mail
ar: لقد تم ارسال بريد التاكيد

source: Ok
ar: تم

source: Try Again
ar: حاول مجددا

# timeOutError
source: This Operation Timed Out
ar: انتهت مهلة هذه العملية

source: Unknown Error
ar: خطأ غير معروف

source: Complete Profile
ar: اكمل الملف

source: Hello
ar: مرحبا

source: We Need To Know More About You
ar: نحن نحتاج اللي معرفة المزيد عنك

source: Pick Your Image
ar: اختر صورتك

source: Camera
ar: الكاميرا

source: Gallery
ar: المعرض

# pickYourImagePickingMethod
source: Pick Image From
ar: اختر صورتك من :

source: Birth Date
ar: تاريخ الميلاد

source: Enter Phone Number
ar: برجاء ادخال رقم الهاتف

# enterValidMobileNumber
source: Enter Valid Phone Number
ar: يرجي ادخال رقم هاتف صحيح

source: Phone
ar: الهاتف

source: Cancel
ar: الغاء

source: Select Your Birth Date
ar: برجاء ادخال تاريخ الميلاد

source: Select Your Gender
ar: من فلك اختر النوع

source: Account Completed Successfully
ar: تم تحديث الحساب بنحاج

# forgetPasswordTitle
source: Forget Password
ar: نسيت كلمة المرور

source: Send Email
ar: ارسال رابط التفعيل

# pleaseEnterEmail
source: Please Enter Email Address
ar: برجاء ادخال عنوان البريد الالكتروني

# resetPasswordEmailSent
source: We Sent Reset Password Mail To Your Email
ar: لقد أرسلنا بريدًا لإعادة تعيين كلمة المرور إلى بريدك الإلكتروني

source: Logging You In ...
ar: جاري تسجيل الدخول ...

source: Welcome Back
ar: مرحبا بك

# emailNotVerified
source: Your Email Not Verified
ar: لم يتم تفعيل حسابك

source: Resend
ar: ارسال

source: Home
ar: الرئيسية

source: Locks
ar: اقفال

source: Keys
ar: مفاتيح

source: chat
ar: دردشة

source: Alerts
ar: تنبيهات

source: Profile
ar: الملف

source: Check Your Internet Connection
ar: برجاء التحقق من الاتصال بالانترنت

# weDontHavePermissions
source: We Don't Have Permission
ar: لا نمتلك التصريح المطلوب

source: Messages
ar: الرسائل

source: Send Message
ar: ارسال رسالة

source: Find Contact
ar: البحث في جهات الاتصال

source: Add Contact
ar: اضافة جهة اتصال

source: Enter Email
ar: ادخل بريد الكتروني

source: Delete Contact
ar: حذف جهة الاتصال

source: Block Contact
ar: حظر حهة الاتصال

# userNotExist
source: User Doesn't Exist
ar: المستخدم غير موجود

# contactAlreadyExist
source: This Contact Already Exist
ar: جهة الاتصال موجودة بالفعل

source: Contact Added Successfully
ar: تم اضافة جهة الاتصال بنجاح

# recursiveChatUnAvailable
source: Unfortunately You Can't Chat With Your Self
ar: لسوء الحظ لا يمكنك التحدث مع نفسك

# youAddedThisUser
source: You Added This Contact
ar: لقد أضفت جهة الاتصال هذه

source: This Contact Just Added You
ar: جهة الاتصال هذه أضافتك للتو

# youHaveNoContactsToChatWith
source: You Have No Contacts To Chat With, Try Adding New Contacts
ar: ليس لديك أي جهات اتصال للدردشة معها، حاول إضافة جهات اتصال جديدة

source: Edit
ar: تعديل

source: Setting
ar: الاعدادات

source: Language
ar: اللغة

source: Lock Management
ar: إدارة القفل

source: Your Feedback
ar: تعليقك

source: Report Issue
ar: الإبلاغ عن المشاكل

source: About Us
ar: معلومات عنا

source: Delete Account
ar: حذف الحساب

source: Sign Out
ar: تسجيل الخروج

source: Feedback
ar: تعليق

# feedbackBodyText
source: We Are Happy That You Are Using Our Application. We Made It With Love For You, And We Are Happy To Experience It And Use It, And Use It And The Rest Of The Family Of Our Applications That We Work On With Every Possible Effort For You For A Fun Experience With Us. Your Evaluation Of This Application And Providing Your Opinion In It Will Help Us To Develop More For You.
ar: نحن سعداء أنك تستخدم تطبيقنا. صنعناه بحب من أجلكم، ويسعدنا تجربته واستخدامه واستخدامه وبقية عائلة تطبيقاتنا التي نعمل عليها بكل جهد ممكن من أجلكم لتجربة ممتعة معنا. إن تقييمك لهذا التطبيق وإبداء رأيك فيه سيساعدنا على تطوير المزيد من أجلك.

source: Send Your Feedback
ar: أرسل تعليقك

# report
source: Report Issue
ar: الابلاغ عن مشكلة

source: We Are Here To Help
ar: نحن هنا لمساعدتك

# reportBodyText
source: What is the Problem With You in Using OUr Smart Door Lock We Will Contact You As Soon As Possible
ar: ما هي المشكلة التي تواجهك في استخدام قفل الباب الذكي الخاص بنا سنتواصل معك بأقرب وقت ممكن

source: Your Report
ar: تقريرك

source: Send Your Report
ar: أرسل تقريرك

# feedbackSent
source: Feedback Sent Successfully
ar: تم ارسال تعلقيك بنجاح

# feedbackAndRating
source: Feedback and Rating Can't be Empty
ar: يجب ادخال تقييم لارسالة

# aboutUs1
source: Hiemdall: Your Digital Guardian, Always Watching Over Your Home
ar: Heimdall: الوصي الرقمي الخاص بك، يراقب منزلك دائمًا

# aboutUs2
source: Welcome to Hiemdall, the revolutionary mobile app that empowers you with seamless control over your smart door lock, ensuring unparalleled convenience and peace of mind. No more fumbling for keys, worrying about forgotten lock codes, or stressing over the security of your home. Hiemdall becomes your digital guardian, offering a range of features to enhance your home security experience.
ar: مرحبًا بك في Hiemdall، تطبيق الهاتف المحمول الثوري الذي يمكّنك من التحكم السلس في قفل بابك الذكي، مما يضمن راحة لا مثيل لها وراحة البال. لا مزيد من التحسس بالمفاتيح، أو القلق بشأن رموز القفل المنسية، أو الضغط على أمان منزلك. يصبح Hiemdall هو الوصي الرقمي عليك، حيث يقدم مجموعة من الميزات لتحسين تجربة أمان منزلك.

# aboutUs3
source: Key Features
ar: المزايا الرئيسية

# aboutUs4
source: One-Tap Unlock: Unlock your door with a single tap, from anywhere in the world. No more frantic searches for misplaced keys or the embarrassment of forgetting the code. Temporary Access: Grant temporary access to friends, family, or service providers. Set expiration times and permissions, ensuring the right people have access at the right times. Real-Time Notifications: Receive instant notifications whenever your door is locked or unlocked, providing complete visibility into who comes and goes. Integrated Sensors: Monitor your home's security with optional integrated sensor capabilities. Keep an eye on temperature, humidity, and even motion detection, all within the Hiemdall app. Multi-Lock Management: Manage multiple locks from a single interface, perfect for homeowners with multiple properties or businesses. Customizable Settings: Tailor settings to suit your needs, from auto-lock timers to voice control integration.
ar: فتح القفل بنقرة واحدة: افتح باب منزلك بنقرة واحدة، من أي مكان في العالم. لا مزيد من عمليات البحث المحمومة عن المفاتيح في غير مكانها أو الإحراج الناتج عن نسيان الرمز. الوصول المؤقت: منح الوصول المؤقت للأصدقاء أو العائلة أو مقدمي الخدمة. قم بتعيين أوقات انتهاء الصلاحية والأذونات، مما يضمن حصول الأشخاص المناسبين على حق الوصول في الأوقات المناسبة. إشعارات في الوقت الفعلي: احصل على إشعارات فورية عندما يكون بابك مغلقًا أو مفتوحًا، مما يوفر رؤية كاملة لمن يأتي ويذهب. أجهزة الاستشعار المدمجة: راقب أمان منزلك من خلال إمكانيات الاستشعار المدمجة الاختيارية. راقب درجة الحرارة والرطوبة وحتى اكتشاف الحركة، كل ذلك من خلال تطبيق Hiemdall. إدارة الأقفال المتعددة: إدارة الأقفال المتعددة من واجهة واحدة، مثالية لأصحاب المنازل الذين لديهم عقارات أو شركات متعددة. إعدادات قابلة للتخصيص: قم بتخصيص الإعدادات لتناسب احتياجاتك، بدءًا من مؤقتات القفل التلقائي وحتى تكامل التحكم الصوتي.

# aboutUs5
source: Peace of Mind
ar: راحة البال

# aboutUs6
source: Hiemdall isn't just about convenience; it's about peace of mind. With Hiemdall, you can:
ar: لا يقتصر اهتمام شركة Heimdall على الراحة فحسب؛ يتعلق الأمر براحة البال. مع هيمدال، يمكنك:

# aboutUs7
source: Relax on vacation knowing your home is safe and sound. Give your children access after school without worry. Grant access to trusted service providers while you're at work. Feel empowered knowing you have complete control over your home's security.
ar: استرخ في إجازة وأنت تعلم أن منزلك آمن وسليم. امنح أطفالك إمكانية الوصول بعد المدرسة دون قلق. امنح حق الوصول لمقدمي الخدمة الموثوقين أثناء تواجدك في العمل. اشعر بالقوة عندما تعلم أن لديك سيطرة كاملة على أمان منزلك.

# aboutUs8
source: Experience the Future of Home Security
ar: اكتشف مستقبل أمان المنزل

# aboutUs9
source: Hiemdall is more than an app; it's a statement. Embrace technology to simplify your life and prioritize your security. Take control of your home and feel confident knowing it's always protected.
ar: Heimdall هو أكثر من مجرد تطبيق. إنه بيان. احتضن التكنولوجيا لتبسيط حياتك وإعطاء الأولوية لأمنك. تحكم في منزلك واشعر بالثقة مع العلم أنه محمي دائمًا.

# applicationVersion
source: App Version : 1.0.1
ar: رقم الاصدار : 1.0.1

source: Development Team
ar: فريق التطوير

source: John Safwat
ar: جون صفوت

source: Abdelrahman Mosaad
ar: عبدالرحمن مسعد

source: Dawoud Elsabah
ar: داوود الصباح

source: Sherif Sayed
ar: شريف سيد

source: Ahmed Yassen
ar: احمد ياسين

source: Mohamed Maher
ar: محمد ماهر

source: Mohammed Mahmoud
ar: محمد محمود

# reportSent
source: Report Sent Successfully and Report Code :
ar: تم ارسال التقرير بنجاح و رقم الشكوي :

# reportCantBeEmpty
source: You Can't Send Empty Report
ar: لا يمكن ارسال تقرير فارغ

# supervisedByDrGoudaIsmail
source: Supervised By : Prof. Dr. Gouda Ismail
ar: يشرف عليها : الاستاذ الدكتور جودة اسماعيل

# areYouSureToExit
source: Are You Sure You Want To Exit
ar: هل أنت متأكد أنك تريد الخروج

# areYouSureToDeleteAccount
source: Are You Sure You Want To Delete Account Be Careful
ar: هل أنت متأكد أنك تريد حذف الحساب كن حذرا

source: Update Profile
ar: تحديث الملف

# tabToPickImage
source: Tab To Pick New Image
ar: انقر لتختار صورة جديدة

# accountUpdated
source: Account Updated Successfully
ar: تم تحديث الحساب

source: Enter Your Phone Number
ar: أدخل رقم هاتفك

# cantSendEmptyMessage
source: Please Enter A Message Content
ar: الرجاء إدخال محتوى الرسالة

source: Message Sent
ar: تم الارسال

# errorSendingMessage
source: Error While Sending Message,Please Try Again
ar: حدث خطأ أثناء إرسال الرسالة، يرجى المحاولة مرة أخرى

source: Change Password
ar: تغير كلمة المرور

source: New Password
ar: كلمة المرور الجديدة

# newPasswordConfirmation
source: Confirm New Password
ar: تاكيد كلمة المرور الجديدة

# passwordUpdated
source: Password Updated Successfully
ar: تم اعادة تعين كلمة المرور

source: We are Watching Every Thing For You
ar: نحن نراقب كل شيء من أجلك

# search
source: Searching For Specific Lock ?
ar: اي قفل تبحث عنة ؟

source: Scan Your Lock
ar: قم بمسح القفل الخاص بك

# configureLockMessage1
source: Now is the time to make sure you are safe. Let us guard this place for you
ar: الآن هو الوقت المناسب للتأكد من سلامتك. دعونا نحرس هذا المكان عوضا عنك

# configureLockMessage2
source: Scan The QR Code On The Lock Package
ar: قم بمسح رمز الاستجابة السريعة الموجود على حزمة القفل

# setLockName
source: Change Lock Name
ar: قم بتغير اسم القفل

source: Confirm
ar: تاكيد

source: Re-Scan
ar: مسح الكود

source: Color
ar: اللون

# lockAdded
source: Lock Added Successfully To Your List
ar: تمت اضافة القفل اللي مجمعتك من الاقفال بنجاح

# empty
source: It's Empty in Here
ar: انها فارغة هنا

source: Lock Details
ar: تفاصيل القفل

source: Image Preview
ar: الصورة

source: Time
ar: الوقت

# doYouWantToSave
source: Do You Want To Save This Image
ar: هل تريد حفظ هذه الصورة

source: Image Saved Successfully
ar: تم حفظ الصورة بنجاح

source: Opened
ar: القفل مفتوح

source: Closed
ar: القفل مغلق

source: Notifications
ar: الاشعارات
